package com.graduation.mah.weather.ui.egypthistory;

import android.content.Intent;
import android.os.Bundle;
import android.view.View;

import androidx.appcompat.app.AppCompatActivity;
import androidx.databinding.DataBindingUtil;

import com.graduation.mah.weather.R;
import com.graduation.mah.weather.databinding.ActivityShowOneDisasterBinding;

public class ShowOneDisaster extends AppCompatActivity {
ActivityShowOneDisasterBinding binding;
Intent intent;
int position =0;
    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);

//        setContentView(R.layout.activity_show_one_disaster);

        binding = DataBindingUtil.setContentView(this, R.layout.activity_show_one_disaster);
        binding.setModel(this);
        binding.back.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View view) {
                onBackPressed();
            }
        });
        intent=getIntent();
        position=intent.getIntExtra("p" , 0);
        switch (position){
            case 0 :

                binding.desc.setText("مصر - فيضانات بسبب انهيار القناة\n" +
                        "\n" +
                        "\n" +
                        "1. بعد انهيار قناة الري الرئيسية في النوبارية ، بالقرب من الإسكندرية ، في أوائل ديسمبر ، حدثت فيضانات في القرى المجاورة مما أدى إلى إصابة العديد من الأشخاص وتسبب في تدمير المنازل. لم يتحدد سبب الانهيار.\n" +
                        "\n" +
                        "2. انتقلت السلطات المحلية إلى مأوى مؤقت وتلبية احتياجاتها الفورية.\n" +
                        "\n" +
                        "3. طلبت حكومة مصر أن تتراجع عن طلب المساعدة الدولية. مواد الإغاثة اللازمة هي الخيام والبطانيات وخزانات المياه والمستشفيات المتنقلة ومسحوق الحليب.\n" +
                        "\n" +
                        "\n" +
                        "\n" +
                        "تقرير الحالة رقم. 2\n" +
                        "3 يناير 1992\n" +
                        "\n" +
                        "1. في 20 ديسمبر 91 ، بعثة التقييم برئاسة ممثل اليونيسف بما في ذلك مسؤولي منظمة الصحة العالمية والهلال الأحمر. في بداية ديسمبر 91 مغمورة بالمياه قيعان من المنازل في قرية العمرية (ضواحي الإسكندرية). نصب العسكريون على الفور مخيمًا للخيام يتسع لـ 1600 شخص ومع مسؤولي وزارة الصحة ، تميل إلى تلبية الاحتياجات الطبية المتضررة. يقتصر الضرر على الممتلكات.\n" +
                        "\n" +
                        "2. احتياجات التخفيف التي تم تحديدها هي الأدوية ، والحبال التي يمكن التخلص منها ، والصابون ، والملابس ، والبطانيات ، ومسحوق الحليب. ساهمت اليونيسف بالفعل في بنود الإغاثة المقدرة بقيمة 5،900.75 دولارًا أمريكيًا للهلال الأحمر والتي أشارت إلى أن البطانيات لم تعد مطلوبة لأن الكميات الكافية موجودة في البلد.\n" +
                        "\n" +
                        "3. هذا آخر تقرير عن حالة هذه الكارثة.\n" +
                        "4. UNDRO توفير 20000 دولار أمريكي للشراء المحلي لمستلزمات الإغاثة.\n" +
                        "\n" +
                        "5. لأغراض التعاون ، يرجى إبلاغ UNDRO على الفور كما هو موضح أدناه من التعهدات / المساهمات (تحديد القيمة حسب البند).");
                binding.textDate.setText("31 Dec 1991");
                binding.title.setText("Egypt: Floods Due To Canal Collapse - Dec 1991");
                binding.imageView2.setImageResource(R.drawable.m1);
                break;
                case 1 :

                binding.desc.setText("مصر - زلزال\n" +
                        "12 أكتوبر 1992\n" +
                        "\n" +
                        "1. ضرب زلزال بقياس 5.9 على مقياس أكثر ثراء (وفقا للبيانات الأولية) مصر في 12 أكتوبر في 15.09 ساعة بالتوقيت المحلي (13.09 ساعة بتوقيت جرينتش) ، حوالي 30 كم جنوب غرب القاهرة. موقع EPICENTER يقع عند 29.9 درجة شمالًا ، 31.0 درجة شرقًا ، وفقًا للمسح الجيولوجي للولايات المتحدة.\n" +
                        "\n" +
                        "2. التقارير الأولية عن الأضرار في القاهرة تشمل الخسائر (حتى 65 قتيلاً وما لا يقل عن 400 جريح) والأضرار التي لحقت بالسكن. تشير التقارير المبكرة إلى حدوث ضرر أسوأ للمباني القديمة ، ومع ذلك ، لم يُعرف بعد المدى الكامل للضرر. هيئة الصحة بدبي في اتصال مع منسق الأمم المتحدة المقيم وقسم الدفاع المدني المصري الذي يقدم معلومات التقييم والاستجابة للطوارئ قيد التنفيذ.\n" +
                        "\n" +
                        "تقرير المعلومات رقم. 2\n" +
                        "12 أكتوبر 1992\n" +
                        "\n" +
                        "1. تشير أحدث التقارير إلى أن عدد القتلى قد يصل إلى 340 مع إصابة 4000 شخص.\n" +
                        "\n" +
                        "2. تم الإبلاغ عن الأضرار المادية في المناطق القديمة لمدينة القاهرة ، بما في ذلك انهيار مبنى مكون من 13 طابقًا.\n" +
                        "\n" +
                        "3. ستة من فريق الطوارئ الحكومي الفرنسي سيغادر الليلة للقيام بمهمة التقييم.\n" +
                        "\n" +
                        "4. هيئة الصحة بدبي / مكتب الأمم المتحدة لإلغاء مهمة ضابطين مسؤولين عن التنسيق العملي والبحث والإنقاذ من أجل مساعدة السلطات الوطنية وممثل الأمم المتحدة المقيم في مجال تقييم الأضرار وتنسيق الموقع للمساعدة.\n" +
                        "\n" +
                        "تقرير المعلومات رقم. 3\n" +
                        "13 أكتوبر 1992\n" +
                        "\n" +
                        "قارة\n" +
                        "\n" +
                        "1. لا يزال تقييم الأضرار قيد التنفيذ في القاهرة والمناطق المحيطة بها بعد أقوى زلزال في تاريخ مصر تلاه هزة صغيرة بعد الصدمة ، تم الإبلاغ عنها في الساعة 23.40 بالتوقيت المحلي (21.40 بتوقيت جرينتش) 12 أكتوبر 1992.\n" +
                        "\n" +
                        "تأثير\n" +
                        "\n" +
                        "2. تم الإبلاغ عن تدمير 182 منزلاً بما في ذلك مبنيين شاهقين. الأشخاص المتضررون ينامون في الشوارع خوفًا من الصدمات.\n" +
                        "\n" +
                        "الاستجابة الوطنية\n" +
                        "\n" +
                        "3. عملت فرق الإغاثة المصرية بلا إطارات طوال الليل بحثًا عن ضحايا وتخليص روبل. المستشفيات المحلية تتعامل مع عدد كبير من المصابين.");
                binding.textDate.setText("12 Oct 1992");
                binding.title.setText("Egypt - Earthquake Oct 1992");
                binding.imageView2.setImageResource(R.drawable.earth2);
                break;
                 case 3 :

                binding.desc.setText("مصر - فيضانات / حرائق\n" +
                        " تقرير المعلومات رقم. 1\n" +
                        "4 نوفمبر 1994\n" +
                        "\n" +
                        "1. أثرت العواصف الرعدية الشديدة والأمطار الشديدة على محافظة أسيوط في جنوب مصر. في دورونكا (عدد السكان: 20000) تقع على بعد 320 كيلومترا جنوب القاهرة في أسيوط الوضع الخطير تضاف إلى وجود مستودع للوقود (ثمانية خزانات وقود).\n" +
                        "\n" +
                        "2. في 2 تشرين الثاني (نوفمبر) ، اكتسح الوقود المشتعل من خلال دورونكا في مياه الفيضانات. تسرب الوقود الناتج عن نقل الوقود و / أو خزانات التفريغ المنفجرة. لم يتم تحديد سبب الإشعال بعد. خزان وقود واحد كان لا يزال مشتعلًا يوم الخميس.\n" +
                        "\n" +
                        "3. عدد النطاقات الميتة المبلغ عنها من أكثر من 200 إلى 500. ولا يزال أكثر من 70 شخصًا في المستشفى مع حروق متعددة. تم إجلاؤها حوالي 20000 شخص وجد معظمهم لاجئين لدى أسر أخرى.\n" +
                        "\n" +
                        "4. جزء من المسكن محترق. العديد من الطرق غير سالكة وقد تم حرق الخضروات والأشجار.\n" +
                        "\n" +
                        "الجهد الوطني\n" +
                        "\n" +
                        "أعلن محافظ المقاطعة رقم 5 حالة الطوارئ. جهد الإغاثة الوطني المستمر. يتم توزيع مستلزمات الإغاثة. مقاتلو الجيش يحاولون السيطرة على النيران.\n" +
                        "\n" +
                        "6. قرر رئيس الوزراء بشأن مراجعة موقع مستودعات الوقود.\n" +
                        "\n" +
                        "7. قامت جمعية الهلال الأحمر المصرية بإيفاد متطوعين إلى الموقع. تستهدف عملية الإغاثة 10000 ضحية في دورونكا ومحيطها. أطلق الاتحاد الدولي لجمعيات الصليب الأحمر والهلال الأحمر نداءً مقابل 1،018،000 فرنك سويسري (795،312 دولارًا أمريكيًا).\n" +
                        "\n" +
                        "8. إلى حد بعيد ، لم تطلب الحكومة من الأمم المتحدة توجيه نداء للحصول على مساعدة دولية.\n" +
                        "\n" +
                        "\n" +
                        " تقرير الحالة رقم. 2\n" +
                        "6 نوفمبر 1994\n" +
                        "\n" +
                        "1. طلبت حكومة مصر من هيئة الصحة بدبي توجيه نداء لتقديم المساعدة الدولية لضحايا الفيضانات في الجزء الجنوبي من البلاد.\n" +
                        "\n" +
                        "2. تأثر 134 قرية في محافظات أسيوط ، سوهاج ، قنا والأقصر\n" +
                        "\n" +
                        "3. الإمدادات اللازمة للإغاثة هي: الخيام ، البطانيات ، الأغطية البلاستيكية ، الملابس (درجة الحرارة في اليوم: 10-20 فوق الصفر / درجة مئوية ، في الليل: من 0 إلى 10 فوق الصفر) ، أدوات منزلية ، حاويات مياه.\n" +
                        "4. سيجري ممثلو وكالات الأمم المتحدة ذات الصلة جنبًا إلى جنب مع ممثل برنامج الأمم المتحدة الإنمائي / هيئة الصحة بدبي تقييمًا في الموقع.\n" +
                        "\n" +
                        "5. أنشأت الحكومة وحدة مركزية في وزارة الشؤون الاجتماعية للتعامل مع هذه الكارثة: رقم الهاتف +202705474 أو +202705402 ، فاكس رقم +202705 390.\n" +
                        "\n" +
                        "6. حددت الحكومة مطار شرق القاهرة كوجهة لرحلات النقل الثنائية.\n" +
                        "\n" +
                        " هيئة الصحة بدبي مستعدة للعمل كقناة للمساهمات النقدية لاستخدامها خلال مرحلة التخفيف الفوري. تُنفق الأموال بالتنسيق مع المنظمات ذات الصلة في نظام الأمم المتحدة ، وتوفر هيئة الصحة بدبي للحكومات المانحة تأكيدًا كتابيًا لاستخدام الأموال المساهمة.\n" +
                        "9. يجب أن يتم تحويل الأموال إلى حساب هيئة الصحة بدبي رقم. CO-590.160.1 في Swiss Bank CORPORATION، CASE POSTALE 2770، CH-1211 GENEVA 2 مع المرجع التالي: مصر / الفيضانات ، - DHA ، جنيف.\n" +
                        "\n" +
                        "10. يجوز للمانحين الراغبين في تقديم مساهمات عينية الاتصال بهيئة الصحة بدبي - جنيف من أجل البحث المتبادل مع الممثل الميداني لهيئة الصحة بدبي فيما يتعلق بمدى ملاءمة نوع العنصر المخفف والكمية.\n" +
                        "\n" +
                        "قسم الشؤون الانسانية - جنيف\n" +
                        "\n" +
                        "الهاتف: + 41-22-917-1234\n" +
                        "في حالة الطوارئ فقط ، الهاتف: + 41-22-917-2010\n" +
                        "\n" +
                        "مسؤول المكتب: E. HAEGLUND ، هاتف مباشر: + 41-22-917-3299\n" +
                        "اضغط للاتصال:\n" +
                        "هيئة الصحة بدبي - جنيف المتحدث الرسمي: السيد. الخطيب ، هاتف مباشر: + 41-22-917-2856\n" +
                        "\n" +
                        "هاتف: 414242 DHA CH\n" +
                        "الفاكس + 41-22-917-0023\n" +
                        "\n" +
                        "البريد الإلكتروني: UNIENET DIALCOM 141: DHAGVA\n" +
                        "\n" +
                        "DPR 310 مصر\n" +
                        "\n" +
                        "DHA-GENEVA 94/0465\n" +
                        "\n" +
                        "مصر - فيضانات\n" +
                        "تقرير حالة هيئة الصحة بدبي جنيف رقم. 3\n" +
                        "11 نوفمبر 1994\n" +
                        "\n" +
                        "1. محافظات أسيوط وقينا وصحاج هي الأكثر تضررا من الفيضانات. 140.000 شخص من الذين سكنوا نصفهم في الخيام / المعسكرات والنصف الآخر وجد ملاجئًا لدى أسرهم / أقاربهم.\n" +
                        "\n" +
                        "2. أشارت الحكومة إلى أن دعم الأمم المتحدة سيكون مطلوبًا في أنشطة إعادة التأهيل / إعادة الإعمار.\n" +
                        "\n" +
                        "3. بالتعاون مع اثنين من أعضاء هيئة الصحة بدبي ، قام فريق إدارة الكوارث التابع للأمم المتحدة بوضع شروط مرجعية لبعثة الأمم المتحدة للتقييم في الموقع. ستشارك اليونيسف وبرنامج الأمم المتحدة الإنمائي وبرنامج الأغذية العالمي ومنظمة الأغذية والزراعة واليونسكو ومنظمة الصحة العالمية في هذه المهمة المقررة في الفترة من 13 إلى 17 نوفمبر / تشرين الثاني 94. وستكون اليونيسف قائد الفريق ، وسوف يعمل برنامج الأمم المتحدة الإنمائي / هيئة الصحة بدبي كمنسق الفريق.\n" +
                        "\n" +
                        "4. ستقوم البعثة بتقييم الوضع العام وكذلك الاحتياجات الفورية وطويلة الأجل في محافظات أسيوط وقينا وصوهاج. كما أنه سيقيم أيضًا ملاءمة المساعدة المقدمة ويصف الترتيبات الملائمة والتنسيق في مكانه ويحدد مجموعات المجتمع المحتملة من أجل التعاون القصير والطويل الأجل.\n" +
                        "\n" +
                        "5. فريق OFDA (الولايات المتحدة الأمريكية) موجود في المنطقة المتضررة وسيعود إلى القاهرة في 11 نوفمبر 94.");
                binding.textDate.setText("4 Nov 1994");
                binding.title.setText("Egypt - Floods Nov 1994");
                binding.imageView2.setImageResource(R.drawable.flood0);
                break;

                 case 2 :

                binding.desc.setText("1. الزلزال الذي أعقبه الزلازل ، ضرب خرطوم في 1 آب / أغسطس. تم الإبلاغ عن الكثافة بين 5 و 6.2 مقياس ثري و EPICENTER حوالي 300 ميل شمال شرق الخرطوم. تقارير صحفية وفاة 3 أشخاص ، وإصابة 10-20. تضرر عدد قليل فقط من المباني.\n" +
                        "\n" +
                        "2. قبل أيام قليلة من وقوع الزلزال ، تم الإبلاغ عن بعض الأنشطة البركانية في أم درمان ، والتي قد تكون مرتبطة بالهزات الأرضية. أوصى المدير العام لمؤسسة الأبحاث الجيولوجية بأن ينام المواطنون في الخارج.\n" +
                        "\n" +
                        "3. ضرب زلزال خفيف القاهرة اليوم ، مما تسبب في اهتزاز المباني الصغيرة. لم تكن هناك تقارير فورية عن الأضرار أو الخسائر.\n" +
                        "\n" +
                        "4. الحكومات لم تطلب المساعدة الدولية.");
                binding.textDate.setText("3 Aug 1993");
                binding.title.setText("Sudan/Egypt - Earthquakes Aug 1993");
                binding.imageView2.setImageResource(R.drawable.earh1);
                break;
                case 4 :
                binding.desc.setText("Since its emergence in April 2009, pandemic influenza A(H1N1) 2009 virus affected all parts of the world, causing the first influenza pandemic since 1968. Following the observation that 1 or 2 epidemic periods had occurred in most countries and in most WHO Regions, WHO declared on 10 Aug 2010 that the world was moving into the post-pandemic period. (WHO, 18 Feb 2011)");
                binding.textDate.setText("1 Apr 2009");
                binding.title.setText("Influenza A (H1N1) Pandemic - Apr 2009");
                binding.imageView2.setImageResource(R.drawable.flue);
                break;
                 case 5 :
                binding.desc.setText("ابتداء من 18 يناير 2010 ، ضربت السيول عدة مجتمعات من شبه جزيرة سيناء وأسوان في مصر. وأودت الفيضانات التي سببتها الأمطار بحياة 12 شخصًا وخلفت مئات النازحين في شبه جزيرة سيناء وميناء الغردقة على البحر الأحمر ومحافظة أسوان في جنوب مصر. (الاتحاد الدولي لجمعيات الصليب الأحمر والهلال الأحمر ، 21 يناير 2010).");
                binding.textDate.setText("21 Jan 2010");
                binding.title.setText("Floods - Jan 2010");
                binding.imageView2.setImageResource(R.drawable.flood);
                break;
                 case 6 :
                binding.desc.setText("أثرت الأمطار الغزيرة والفيضانات على محافظات أسيوط والبحر الأحمر وسوهاج وجنوب سيناء وقنا في أواخر أكتوبر وأوائل نوفمبر.\n" +
                        "\n" +
                        "وأجبرت الأمطار الغزيرة ، التي بدأت في وقت متأخر من يوم الأربعاء 26 أكتوبر 2016 ، إلى جانب رياح شديدة بشكل استثنائي ، السلطات على إغلاق أربعة موانئ بحرية في محافظتي السويس وبورسعيد وإغلاق بعض المدارس والطرق الرئيسية. ما لا يقل عن 6500 أسرة - ما يقرب من 32500 شخص - بحاجة إلى الغذاء الطارئ والمأوى والمياه والصرف الصحي. وقتل 26 شخصا وجرح 72. (OCHA ، 5 ديسمبر 2016)\n" +
                        "\n" +
                        "تتعرض المناطق الجبلية في صعيد مصر والبحر الأحمر ، وهي المناطق الفقيرة ذات البنية التحتية السيئة ، لأمطار غزيرة سنويًا في أواخر أكتوبر وأوائل نوفمبر. نتيجة لسوء الأحوال الجوية ، ضربت الأمطار الغزيرة والفيضانات عدة محافظات بمصر (جنوب سيناء ، والبحر الأحمر ، وسوهاج ، وقنا ، وأسيوط). إضافة إلى الوفيات والإصابات ، جرفت المنازل ، وأغلقت الطرق الرئيسية ، وقطعت خطوط الهاتف والكهرباء خاصة في محافظة البحر الأحمر. (الاتحاد الدولي لجمعيات الصليب الأحمر والهلال الأحمر ، 9 نوفمبر 2016).\n" +
                        "\n" +
                        "يدعم الاتحاد الأوروبي الهلال الأحمر المصري في تقديم مساعدات إغاثية لتلبية الاحتياجات الفورية لما يصل إلى 10.000 شخص متضرر من الفيضانات: سيساعد ذلك في تمويل استجابة الإسعافات الأولية بالإضافة إلى تعزيز النظافة والأدوات لتقليل مخاطر المياه والصرف الصحي. الأمراض المتعلقة بالصرف الصحي. (ECHO ، 21 نوفمبر 2016)");
                binding.textDate.setText("26 October 2016");
                binding.title.setText("Egypt: Floods - Oct 2016");
                binding.imageView2.setImageResource(R.drawable.flood3);
                break;
                 case 7 :
                binding.desc.setText("ي 11 مارس 2020 ، أصدر الهلال الأحمر المصري إنذارًا طارئًا وقام بتنشيط مركز عمليات الطوارئ المركزي (EOC) وكذلك غرف عمليات الطوارئ في الفروع. تسبب استمرار الطقس القاسي ، بما في ذلك الأمطار الغزيرة والرياح القوية والعواصف الرعدية ، في فيضانات واسعة النطاق في جميع أنحاء مصر ، مما أسفر عن مقتل 40 شخصًا على الأقل. وبحسب وزارة التضامن الاجتماعي ، لقي 10 أشخاص مصرعهم وأصيب أكثر من 400 في القاهرة ، وتوفي 3 أشخاص وأصيب 5 في محافظة قنا (وسط مصر). ووقعت الوفيات المتبقية في محافظات الجيزة والإسماعيلية والشرقية والوادي الجديد والمنوفية وجنوب سيناء ، حيث فقد 12 شخصًا. توقفت خدمة القطارات على مستوى الجمهورية ، حيث تسببت الأمطار الغزيرة في تصادم قطارين شمال الجيزة ، مما أدى إلى إصابة 13 شخصًا. وتقدر الأرقام الرسمية التي أوردتها وزارة التضامن الاجتماعي حول عدد المتضررين من الفيضانات في البلاد بحوالي 20 ألف شخص (4000 أسرة). (الاتحاد الدولي لجمعيات الصليب الأحمر والهلال الأحمر ، 26 مارس 2020).");
                binding.textDate.setText("11 March 2020");
                binding.title.setText("Floods - Mar 2020");
                binding.imageView2.setImageResource(R.drawable.flood2);
                break;
                 case 8 :

                binding.desc.setText("Translation is too long to be saved\n" +
                        "تعرضت محافظة أسوان المصرية لأمطار غزيرة أدت إلى فيضانات في 11 منطقة في الفترة ما بين 12 و 14 نوفمبر 2021. وبحسب إعلان وزارة الصحة ، فإن استمرار سوء الأحوال الجوية ، بما في ذلك الأمطار الغزيرة والرياح القوية والعواصف الرعدية ، تسببت في حدوث فيضانات واسعة النطاق في جميع أنحاء البلاد. الجزء الجنوبي الشرقي من مصر ، طرد العقارب من الأرض ، مما أدى إلى مقتل ثلاثة أشخاص وإصابة 450 آخرين بسبب لدغات العقارب. [...] بسبب انسداد الطرق الرئيسية ، تم عزل بعض المواقع / القرى. تم استضافة ما مجموعه 1،100 شخص (220 عائلة) ممن فقدوا منازلهم بسبب الأضرار الكلية في 220 منزل مؤقت تديره السلطة المحلية لمحافظة أسوان ، بينما لا يزال 4،685 شخصًا (937 عائلة) يعيشون في منازلهم التي تضررت جزئيًا. ورفضت المغادرة. [...] تقود وزارة التضامن الاجتماعي والهلال الأحمر المصري التقييم التفصيلي في 14 قرية في أسوان. وبحسب البيانات الأولية ، فقد أثرت الفيضانات حتى الآن على 5،935 شخصًا (1،157 أسرة). (الاتحاد الدولي لجمعيات الصليب الأحمر والهلال الأحمر ، 29 نوفمبر 2021).");
                binding.textDate.setText("12 November 2021");
                binding.title.setText("Egypt: Floods - Nov 2021");
                binding.imageView2.setImageResource(R.drawable.flood4);
                break;

        }









//        egModels.add(new EGModel("Syria/Iraq: Polio Outbreak - Oct 2013" , "", "" ,"" , 0));






    }
}